var questions = [
    {
        "question":"沒事時，喜歡在家待著還是出門社交呢？",
        "answers":[
            ["在家",2],
            ["出門",2]
        ]
    },
    {
        "question":"覺得自己是哪種人呢？",
        "answers":[
            ["忍耐性高",3],
            ["固執不願妥協",3]
        ]
    },
    {
        "question":"認為自己的個性偏向？",
        "answers":[
            ["活潑",4],
            ["內向",4]
        ]
    },
    {
        "question":"下面幾種蔬菜，你最不喜歡吃的是？",
        "answers":[
            ["冬瓜",5],
            ["白菜",5]
        ]
    },
    {
        "question":"面對團體問題時你會?",
        "answers":[
            ["積極主動","B"],
            ["等待別人來找我","A"]
        ]
    },
    {
        "question":"若在路上看到一大群人聚在一起，你會？",
        "answers":[
            ["靠近圍觀","D"],
            ["直接走掉","C"]
        ]
    },
    
];

var finalAnswers={
        "A":["樹懶","樹懶的生活邏輯就是一個大寫的懶啊。它基本只吃夠得著的樹葉，因為樹葉不太會逃跑；懶得喝水，反正葉子裡就含水；吃東西幾乎不嚼，含在口裡慢慢就消化了嘛。「慢慢消化」的意思是需要 30 天以上。懶也造就強大的耐力，所以它懶得去吃，懶得去玩，遇到天敵也懶得躲，用一生去靜止倒掛著在樹上，哪怕挨餓一個月也不移動地方。"],
        "B":["柴犬","柴犬天性較為大膽、獨立，同時也有頑固一面[4]。有些柴犬警戒心較強，也有些柴犬對人類較為友好，柴犬對於主人或其認可的人類較為忠誠，由於柴犬在古代是作為追緝獵物的獵犬使用，因此通常具有一定警戒心與攻擊性，一般來說，母柴犬的攻擊性比公柴犬來得較為兇猛。柴犬與貓之間通常能夠和平相處。 柴犬個性固執，如果沒從幼犬開始飼養訓練，可能會成為頑固又愛耍脾氣的狗。 柴犬是一種相對自律的犬種，並經常喜歡保持自己身體的潔淨。柴犬經常會用舌頭清潔自己的腳掌和腿部。"],
        "C":["刺蝟","刺蝟，是一種性格非常孤僻的動物，住在灌木叢內，會游泳，膽小易驚、喜靜厭鬧，喜暗怕光、怕熱怕驚。"],
        "D":["綿羊","黃金獵犬是一個均稱、有力、活潑的犬種，腿既不太長也不笨拙，表情友善，個性熱情、機警、自信、容易訓練也相當聽話。 因其是一種獵犬，在困苦的工作環境中才能表現出他的本質特點。"],
};
